Revit 2024 API
BasicFileInfo.IsLocal Property
 Checks if the file is workshared and Local.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsLocal { get; }
Visual Basic
Public ReadOnly Property IsLocal As Boolean
	Get
Visual C++
public:
property bool IsLocal {
	bool get ();
}
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace